funcs.org
#+TITLE: List of Jack functions to implement
#+OPTIONS: toc:1 ^:nil num:nil
#+HTML_HEAD: <style type="text/css">body { background-color:#B2B6B9} .outline-3 {margin-left:10pt} .outline-4 {margin-left: 20pt}</style>

* jack.h [41/75] [54%]
** DONE jack_client_open (const char *client_name, jack_options_t options, jack_status_t *status,...) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_client_close (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_client_name_size (void) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_get_client_name (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_get_uuid_for_client_name (jack_client_t *client, const char *name) JACK_WEAK_EXPORT
** DONE jack_get_client_name_by_uuid (jack_client_t *client, const char *uuid) JACK_WEAK_EXPORT
** DONE jack_activate (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_deactivate (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_client_thread_id (jack_client_t *) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_is_realtime (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_cycle_wait (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_cycle_signal (jack_client_t *client, int status) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_process_thread (jack_client_t *client, JackThreadCallback fun, void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_thread_init_callback (jack_client_t *client, JackThreadInitCallback thread_init_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_on_shutdown (jack_client_t *client, JackShutdownCallback function, void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_on_info_shutdown (jack_client_t *client, JackInfoShutdownCallback function, void *arg) JACK_WEAK_EXPORT
** DONE jack_set_process_callback (jack_client_t *client, JackProcessCallback process_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_freewheel_callback (jack_client_t *client, JackFreewheelCallback freewheel_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_buffer_size_callback (jack_client_t *client, JackBufferSizeCallback bufsize_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_sample_rate_callback (jack_client_t *client, JackSampleRateCallback srate_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_client_registration_callback (jack_client_t *, JackClientRegistrationCallback registration_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_port_registration_callback (jack_client_t *, JackPortRegistrationCallback registration_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_port_rename_callback (jack_client_t *, JackPortRenameCallback rename_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_port_connect_callback (jack_client_t *, JackPortConnectCallback connect_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_graph_order_callback (jack_client_t *, JackGraphOrderCallback graph_callback, void *) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_xrun_callback (jack_client_t *, JackXRunCallback xrun_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_latency_callback (jack_client_t *, JackLatencyCallback latency_callback, void *) JACK_WEAK_EXPORT
** TODO jack_set_freewheel (jack_client_t *client, int onoff) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_buffer_size (jack_client_t *client, jack_nframes_t nframes) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_get_sample_rate (jack_client_t *) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_get_buffer_size (jack_client_t *) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_cpu_load (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_register (jack_client_t *client, const char *port_name, const char *port_type, unsigned long flags, unsigned long buffer_size) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_unregister (jack_client_t *, jack_port_t *) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_get_buffer (jack_port_t *, jack_nframes_t) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_name (const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_uuid (const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_short_name (const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_flags (const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_type (const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_is_mine (const jack_client_t *, const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_connected (const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_connected_to (const jack_port_t *port, const char *port_name) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_get_connections (const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_get_all_connections (const jack_client_t *client, const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_set_name (jack_port_t *port, const char *port_name) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_set_alias (jack_port_t *port, const char *alias) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_unset_alias (jack_port_t *port, const char *alias) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_get_aliases (const jack_port_t *port, char *const aliases) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_request_monitor (jack_port_t *port, int onoff) JACK_OPTIONAL_WEAK_EXPORT
** DONE jack_port_request_monitor_by_name (jack_client_t *client, const char *port_name, int onoff) JACK_OPTIONAL_WEAK_EXPORT
