funcs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>List of Jack functions to implement</title>
<!-- 2014-12-05 Fri 12:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">List of Jack functions to implement</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">jack.h <code>[41/75]</code> <code>[54%]</code></a></li>
<li><a href="#sec-2">transport.h <code>[1/12]</code> <code>[8%]</code></a></li>
<li><a href="#sec-3">midiport.h <code>[6/7]</code> <code>[85%]</code></a></li>
<li><a href="#sec-4">intclient.h <code>[0/4]</code> <code>[0%]</code></a></li>
<li><a href="#sec-5">statistics.h <code>[0/3]</code> <code>[0%]</code></a></li>
<li><a href="#sec-6">ringbuffer.h <code>[0/13]</code> <code>[0%]</code></a></li>
<li><a href="#sec-7">thread.h <code>[0/6]</code> <code>[0%]</code></a></li>
<li><a href="#sec-8">session.h <code>[0/8]</code> <code>[0%]</code></a></li>
<li><a href="#sec-9">control.h <code>[0/39]</code> <code>[0%]</code></a></li>
<li><a href="#sec-10">property.h <code>[0/9]</code> <code>[0%]</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">jack.h <code>[41/75]</code> <code>[54%]</code></h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="done DONE">DONE</span> jack_client_open (const char *client_name, jack_options_t options, jack_status_t *status,&#x2026;) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="done DONE">DONE</span> jack_client_close (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="done DONE">DONE</span> jack_client_name_size (void) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="done DONE">DONE</span> jack_get_client_name (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="done DONE">DONE</span> jack_get_uuid_for_client_name (jack_client_t *client, const char *name) JACK_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="done DONE">DONE</span> jack_get_client_name_by_uuid (jack_client_t *client, const char *uuid) JACK_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="done DONE">DONE</span> jack_activate (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="done DONE">DONE</span> jack_deactivate (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="done DONE">DONE</span> jack_client_thread_id (jack_client_t *) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="done DONE">DONE</span> jack_is_realtime (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="done DONE">DONE</span> jack_cycle_wait (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="done DONE">DONE</span> jack_cycle_signal (jack_client_t *client, int status) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="todo TODO">TODO</span> jack_set_process_thread (jack_client_t *client, JackThreadCallback fun, void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="todo TODO">TODO</span> jack_set_thread_init_callback (jack_client_t *client, JackThreadInitCallback thread_init_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="todo TODO">TODO</span> jack_on_shutdown (jack_client_t *client, JackShutdownCallback function, void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="todo TODO">TODO</span> jack_on_info_shutdown (jack_client_t *client, JackInfoShutdownCallback function, void *arg) JACK_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-17" class="outline-3">
<h3 id="sec-1-17"><span class="done DONE">DONE</span> jack_set_process_callback (jack_client_t *client, JackProcessCallback process_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-18" class="outline-3">
<h3 id="sec-1-18"><span class="todo TODO">TODO</span> jack_set_freewheel_callback (jack_client_t *client, JackFreewheelCallback freewheel_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-19" class="outline-3">
<h3 id="sec-1-19"><span class="todo TODO">TODO</span> jack_set_buffer_size_callback (jack_client_t *client, JackBufferSizeCallback bufsize_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-20" class="outline-3">
<h3 id="sec-1-20"><span class="todo TODO">TODO</span> jack_set_sample_rate_callback (jack_client_t *client, JackSampleRateCallback srate_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-21" class="outline-3">
<h3 id="sec-1-21"><span class="todo TODO">TODO</span> jack_set_client_registration_callback (jack_client_t *, JackClientRegistrationCallback registration_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-22" class="outline-3">
<h3 id="sec-1-22"><span class="todo TODO">TODO</span> jack_set_port_registration_callback (jack_client_t *, JackPortRegistrationCallback registration_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-23" class="outline-3">
<h3 id="sec-1-23"><span class="todo TODO">TODO</span> jack_set_port_rename_callback (jack_client_t *, JackPortRenameCallback rename_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-24" class="outline-3">
<h3 id="sec-1-24"><span class="todo TODO">TODO</span> jack_set_port_connect_callback (jack_client_t *, JackPortConnectCallback connect_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-25" class="outline-3">
<h3 id="sec-1-25"><span class="todo TODO">TODO</span> jack_set_graph_order_callback (jack_client_t *, JackGraphOrderCallback graph_callback, void *) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-26" class="outline-3">
<h3 id="sec-1-26"><span class="todo TODO">TODO</span> jack_set_xrun_callback (jack_client_t *, JackXRunCallback xrun_callback, void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-27" class="outline-3">
<h3 id="sec-1-27"><span class="todo TODO">TODO</span> jack_set_latency_callback (jack_client_t *, JackLatencyCallback latency_callback, void *) JACK_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-28" class="outline-3">
<h3 id="sec-1-28"><span class="todo TODO">TODO</span> jack_set_freewheel (jack_client_t *client, int onoff) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-29" class="outline-3">
<h3 id="sec-1-29"><span class="todo TODO">TODO</span> jack_set_buffer_size (jack_client_t *client, jack_nframes_t nframes) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-30" class="outline-3">
<h3 id="sec-1-30"><span class="done DONE">DONE</span> jack_get_sample_rate (jack_client_t *) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-31" class="outline-3">
<h3 id="sec-1-31"><span class="todo TODO">TODO</span> jack_get_buffer_size (jack_client_t *) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-32" class="outline-3">
<h3 id="sec-1-32"><span class="todo TODO">TODO</span> jack_cpu_load (jack_client_t *client) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-33" class="outline-3">
<h3 id="sec-1-33"><span class="done DONE">DONE</span> jack_port_register (jack_client_t *client, const char *port_name, const char *port_type, unsigned long flags, unsigned long buffer_size) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-34" class="outline-3">
<h3 id="sec-1-34"><span class="done DONE">DONE</span> jack_port_unregister (jack_client_t *, jack_port_t *) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-35" class="outline-3">
<h3 id="sec-1-35"><span class="done DONE">DONE</span> jack_port_get_buffer (jack_port_t *, jack_nframes_t) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-36" class="outline-3">
<h3 id="sec-1-36"><span class="done DONE">DONE</span> jack_port_name (const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-37" class="outline-3">
<h3 id="sec-1-37"><span class="done DONE">DONE</span> jack_port_uuid (const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-38" class="outline-3">
<h3 id="sec-1-38"><span class="done DONE">DONE</span> jack_port_short_name (const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-39" class="outline-3">
<h3 id="sec-1-39"><span class="done DONE">DONE</span> jack_port_flags (const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-40" class="outline-3">
<h3 id="sec-1-40"><span class="done DONE">DONE</span> jack_port_type (const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-1-41" class="outline-3">
<h3 id="sec-1-41"><span class="done DONE">DONE</span> jack_port_is_mine (const jack_client_t *, const jack_port_t *port) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
