funcs.org
** TODO jack_internal_client_handle (jack_client_t *client, const char *client_name, jack_status_t *status, jack_intclient_t handle)
** TODO jack_internal_client_load (jack_client_t *client, const char *client_name, jack_options_t options, jack_status_t *status, jack_intclient_t,...)
** TODO jack_internal_client_unload (jack_client_t *client, jack_intclient_t intclient)
* statistics.h [0/3] [0%]
** TODO jack_get_max_delayed_usecs (jack_client_t *client)
** TODO jack_get_xrun_delayed_usecs (jack_client_t *client)
** TODO jack_reset_max_delayed_usecs (jack_client_t *client)
* ringbuffer.h [0/13] [0%]
** TODO jack_ringbuffer_create (size_t sz)
** TODO jack_ringbuffer_free (jack_ringbuffer_t *rb)
** TODO jack_ringbuffer_get_read_vector (const jack_ringbuffer_t *rb, jack_ringbuffer_data_t *vec)
** TODO jack_ringbuffer_get_write_vector (const jack_ringbuffer_t *rb, jack_ringbuffer_data_t *vec)
** TODO jack_ringbuffer_read (jack_ringbuffer_t *rb, char *dest, size_t cnt)
** TODO jack_ringbuffer_peek (jack_ringbuffer_t *rb, char *dest, size_t cnt)
** TODO jack_ringbuffer_read_advance (jack_ringbuffer_t *rb, size_t cnt)
** TODO jack_ringbuffer_read_space (const jack_ringbuffer_t *rb)
** TODO jack_ringbuffer_mlock (jack_ringbuffer_t *rb)
** TODO jack_ringbuffer_reset (jack_ringbuffer_t *rb)
** TODO jack_ringbuffer_write (jack_ringbuffer_t *rb, const char *src, size_t cnt)
** TODO jack_ringbuffer_write_advance (jack_ringbuffer_t *rb, size_t cnt)
** TODO jack_ringbuffer_write_space (const jack_ringbuffer_t *rb)
* thread.h [0/6] [0%]
** TODO jack_client_real_time_priority (jack_client_t *) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_client_max_real_time_priority (jack_client_t *) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_acquire_real_time_scheduling (jack_native_thread_t thread, int priority) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_client_create_thread (jack_client_t *client, jack_native_thread_t *thread, int priority, int realtime, void *(*start_routine)(void *), void *arg) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_drop_real_time_scheduling (jack_native_thread_t thread) JACK_OPTIONAL_WEAK_EXPORT
** TODO jack_set_thread_creator (jack_thread_creator_t creator) JACK_OPTIONAL_WEAK_EXPORT
* session.h [0/8] [0%]
** TODO jack_set_session_callback (jack_client_t *client, JackSessionCallback session_callback, void *arg) JACK_WEAK_EXPORT
** TODO jack_session_reply (jack_client_t *client, jack_session_event_t *event) JACK_WEAK_EXPORT
** TODO jack_session_event_free (jack_session_event_t *event) JACK_WEAK_EXPORT
** TODO jack_client_get_uuid (jack_client_t *client) JACK_WEAK_EXPORT
** TODO jack_session_notify (jack_client_t *client, const char *target, jack_session_event_type_t type, const char *path) JACK_WEAK_EXPORT
** TODO jack_session_commands_free (jack_session_command_t *cmds) JACK_WEAK_EXPORT
** TODO jack_reserve_client_name (jack_client_t *client, const char *name, const char *uuid) JACK_WEAK_EXPORT
** TODO jack_client_has_session_callback (jack_client_t *client, const char *client_name) JACK_WEAK_EXPORT
* control.h [0/39] [0%]
** TODO jackctl_setup_signals (unsigned int flags)
** TODO jackctl_wait_signals (sigset_t signals)
** TODO jackctl_server_create (bool(*on_device_acquire)(const char *device_name), void(*on_device_release)(const char *device_name))
** TODO jackctl_server_destroy (jackctl_server_t *server)
** TODO jackctl_server_start (jackctl_server_t *server, jackctl_driver_t *driver)
** TODO jackctl_server_stop (jackctl_server_t *server)
** TODO jackctl_server_get_drivers_list (jackctl_server_t *server)
** TODO jackctl_server_get_parameters (jackctl_server_t *server)
** TODO jackctl_server_get_internals_list (jackctl_server_t *server)
** TODO jackctl_server_load_internal (jackctl_server_t *server, jackctl_internal_t *internal)
** TODO jackctl_server_unload_internal (jackctl_server_t *server, jackctl_internal_t *internal)
** TODO jackctl_server_add_slave (jackctl_server_t *server, jackctl_driver_t *driver)
** TODO jackctl_server_remove_slave (jackctl_server_t *server, jackctl_driver_t *driver)
** TODO jackctl_server_switch_master (jackctl_server_t *server, jackctl_driver_t *driver)
** TODO jackctl_driver_get_name (jackctl_driver_t *driver)
** TODO jackctl_driver_get_parameters (jackctl_driver_t *driver)
** TODO jackctl_internal_get_name (jackctl_internal_t *internal)
** TODO jackctl_internal_get_parameters (jackctl_internal_t *internal)
** TODO jackctl_parameter_get_name (jackctl_parameter_t *parameter)
** TODO jackctl_parameter_get_short_description (jackctl_parameter_t *parameter)
** TODO jackctl_parameter_get_long_description (jackctl_parameter_t *parameter)
** TODO jackctl_parameter_get_type (jackctl_parameter_t *parameter)
** TODO jackctl_parameter_get_id (jackctl_parameter_t *parameter)
** TODO jackctl_parameter_is_set (jackctl_parameter_t *parameter)
** TODO jackctl_parameter_reset (jackctl_parameter_t *parameter)
** TODO jackctl_parameter_get_value (jackctl_parameter_t *parameter)
