funcs.html
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="todo TODO">TODO</span> jack_internal_client_handle (jack_client_t *client, const char *client_name, jack_status_t *status, jack_intclient_t handle)</h3>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="todo TODO">TODO</span> jack_internal_client_load (jack_client_t *client, const char *client_name, jack_options_t options, jack_status_t *status, jack_intclient_t,&#x2026;)</h3>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="todo TODO">TODO</span> jack_internal_client_unload (jack_client_t *client, jack_intclient_t intclient)</h3>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">statistics.h <code>[0/3]</code> <code>[0%]</code></h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="todo TODO">TODO</span> jack_get_max_delayed_usecs (jack_client_t *client)</h3>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="todo TODO">TODO</span> jack_get_xrun_delayed_usecs (jack_client_t *client)</h3>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="todo TODO">TODO</span> jack_reset_max_delayed_usecs (jack_client_t *client)</h3>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">ringbuffer.h <code>[0/13]</code> <code>[0%]</code></h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="todo TODO">TODO</span> jack_ringbuffer_create (size_t sz)</h3>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="todo TODO">TODO</span> jack_ringbuffer_free (jack_ringbuffer_t *rb)</h3>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="todo TODO">TODO</span> jack_ringbuffer_get_read_vector (const jack_ringbuffer_t *rb, jack_ringbuffer_data_t *vec)</h3>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="todo TODO">TODO</span> jack_ringbuffer_get_write_vector (const jack_ringbuffer_t *rb, jack_ringbuffer_data_t *vec)</h3>
</div>
<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="todo TODO">TODO</span> jack_ringbuffer_read (jack_ringbuffer_t *rb, char *dest, size_t cnt)</h3>
</div>
<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="todo TODO">TODO</span> jack_ringbuffer_peek (jack_ringbuffer_t *rb, char *dest, size_t cnt)</h3>
</div>
<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="todo TODO">TODO</span> jack_ringbuffer_read_advance (jack_ringbuffer_t *rb, size_t cnt)</h3>
</div>
<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="todo TODO">TODO</span> jack_ringbuffer_read_space (const jack_ringbuffer_t *rb)</h3>
</div>
<div id="outline-container-sec-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="todo TODO">TODO</span> jack_ringbuffer_mlock (jack_ringbuffer_t *rb)</h3>
</div>
<div id="outline-container-sec-6-10" class="outline-3">
<h3 id="sec-6-10"><span class="todo TODO">TODO</span> jack_ringbuffer_reset (jack_ringbuffer_t *rb)</h3>
</div>
<div id="outline-container-sec-6-11" class="outline-3">
<h3 id="sec-6-11"><span class="todo TODO">TODO</span> jack_ringbuffer_write (jack_ringbuffer_t *rb, const char *src, size_t cnt)</h3>
</div>
<div id="outline-container-sec-6-12" class="outline-3">
<h3 id="sec-6-12"><span class="todo TODO">TODO</span> jack_ringbuffer_write_advance (jack_ringbuffer_t *rb, size_t cnt)</h3>
</div>
<div id="outline-container-sec-6-13" class="outline-3">
<h3 id="sec-6-13"><span class="todo TODO">TODO</span> jack_ringbuffer_write_space (const jack_ringbuffer_t *rb)</h3>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">thread.h <code>[0/6]</code> <code>[0%]</code></h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="todo TODO">TODO</span> jack_client_real_time_priority (jack_client_t *) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="todo TODO">TODO</span> jack_client_max_real_time_priority (jack_client_t *) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="todo TODO">TODO</span> jack_acquire_real_time_scheduling (jack_native_thread_t thread, int priority) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="todo TODO">TODO</span> jack_client_create_thread (jack_client_t *client, jack_native_thread_t *thread, int priority, int realtime, void *(*start_routine)(void *), void *arg) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="todo TODO">TODO</span> jack_drop_real_time_scheduling (jack_native_thread_t thread) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="todo TODO">TODO</span> jack_set_thread_creator (jack_thread_creator_t creator) JACK_OPTIONAL_WEAK_EXPORT</h3>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">session.h <code>[0/8]</code> <code>[0%]</code></h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="todo TODO">TODO</span> jack_set_session_callback (jack_client_t *client, JackSessionCallback session_callback, void *arg) JACK_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="todo TODO">TODO</span> jack_session_reply (jack_client_t *client, jack_session_event_t *event) JACK_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="todo TODO">TODO</span> jack_session_event_free (jack_session_event_t *event) JACK_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="todo TODO">TODO</span> jack_client_get_uuid (jack_client_t *client) JACK_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="todo TODO">TODO</span> jack_session_notify (jack_client_t *client, const char *target, jack_session_event_type_t type, const char *path) JACK_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="todo TODO">TODO</span> jack_session_commands_free (jack_session_command_t *cmds) JACK_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-8-7" class="outline-3">
<h3 id="sec-8-7"><span class="todo TODO">TODO</span> jack_reserve_client_name (jack_client_t *client, const char *name, const char *uuid) JACK_WEAK_EXPORT</h3>
</div>
<div id="outline-container-sec-8-8" class="outline-3">
<h3 id="sec-8-8"><span class="todo TODO">TODO</span> jack_client_has_session_callback (jack_client_t *client, const char *client_name) JACK_WEAK_EXPORT</h3>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">control.h <code>[0/39]</code> <code>[0%]</code></h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="todo TODO">TODO</span> jackctl_setup_signals (unsigned int flags)</h3>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="todo TODO">TODO</span> jackctl_wait_signals (sigset_t signals)</h3>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="todo TODO">TODO</span> jackctl_server_create (bool(*on_device_acquire)(const char *device_name), void(*on_device_release)(const char *device_name))</h3>
</div>
